{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_24", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_24", "trainable": true, "batch_input_shape": [null, 20], "dtype": "float32", "input_dim": 2000, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_37", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_49", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "zero_output_for_mask": true, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_38", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_50", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "zero_output_for_mask": true, "units": 48, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_39", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_51", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "zero_output_for_mask": true, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Flatten", "config": {"name": "flatten_17", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_56", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_57", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1.0000000116860974e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_37/forward_lstm_49/kernel", "shape": [8, 256], "dtype": "float32"}, {"name": "bidirectional_37/forward_lstm_49/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_37/forward_lstm_49/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_37/backward_lstm_49/kernel", "shape": [8, 256], "dtype": "float32"}, {"name": "bidirectional_37/backward_lstm_49/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_37/backward_lstm_49/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_38/forward_lstm_50/kernel", "shape": [128, 192], "dtype": "float32"}, {"name": "bidirectional_38/forward_lstm_50/recurrent_kernel", "shape": [48, 192], "dtype": "float32"}, {"name": "bidirectional_38/forward_lstm_50/bias", "shape": [192], "dtype": "float32"}, {"name": "bidirectional_38/backward_lstm_50/kernel", "shape": [128, 192], "dtype": "float32"}, {"name": "bidirectional_38/backward_lstm_50/recurrent_kernel", "shape": [48, 192], "dtype": "float32"}, {"name": "bidirectional_38/backward_lstm_50/bias", "shape": [192], "dtype": "float32"}, {"name": "bidirectional_39/forward_lstm_51/kernel", "shape": [96, 128], "dtype": "float32"}, {"name": "bidirectional_39/forward_lstm_51/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_39/forward_lstm_51/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_39/backward_lstm_51/kernel", "shape": [96, 128], "dtype": "float32"}, {"name": "bidirectional_39/backward_lstm_51/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_39/backward_lstm_51/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_56/kernel", "shape": [1280, 16], "dtype": "float32"}, {"name": "dense_56/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_57/kernel", "shape": [16, 4], "dtype": "float32"}, {"name": "dense_57/bias", "shape": [4], "dtype": "float32"}, {"name": "embedding_24/embeddings", "shape": [2000, 8], "dtype": "float32"}]}]}